app/views/movies/show.html.haml

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 19]]
---

    - @movie.reviews.each do |review|