app/controllers/movies_controller.rb

    def show
      id = params[:id] # retrieve movie ID from URI route
      @movie = Movie.find(id) # look up movie by unique ID
      @sum=0
      @movie.reviews.all.each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 7]]
SELECT "movies".* FROM "movies"