app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY title
---
    def index
      @movies = Movie.all.order('title')

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "a"], ["rating", "G"], ["description", ""], ["release_date", "2020-10-09 00:00:00"], ["created_at", "2020-10-09 18:44:47.930433"], ["updated_at", "2020-10-09 18:44:47.930433"]]
---
    def create
      params.require(:movie)
      permitted = params[:movie].permit(:title,:rating,:release_date,:description)
      @movie = Movie.create!(permitted)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def edit
      if set_current_user
        @movie = Movie.find params[:id]

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "qwe"], ["updated_at", "2020-10-09 17:27:08.743650"], ["id", 8]]
---
    def update
      @movie = Movie.find params[:id]
      permitted = params[:movie].permit(:title,:rating,:release_date,:description)
      @movie.update_attributes!(permitted)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 3]]
---
    def destroy
      if set_current_user
        @movie = Movie.find(params[:id])
        @movie.destroy