app/controllers/reviews_controller.rb

    def has_moviegoer_and_movie
      unless @current_user
        flash[:warning] = 'You must be logged in to create a review.'
        redirect_to '/auth/twitter'
      end
      unless (@movie = Movie.find_by(:id => params[:movie_id]))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def create
      # since moviegoer_id is a protected attribute that won't get
      # assigned by the mass-assignment from params[:review], we set it
      # by using the << method on the association.  We could also

      @current_user.reviews << @movie.reviews.build(params[:review].permit(:potatoes,:comments))
---
INSERT INTO "reviews" ("potatoes", "comments", "moviegoer_id", "movie_id") VALUES (?, ?, ?, ?)  [["potatoes", 1], ["comments", "sadsad"], ["moviegoer_id", 1], ["movie_id", 7]]

    def edit

        @review = @movie.reviews.find params[:id]
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 19], ["id", 8], ["LIMIT", 1]]

    def update
        @review = @movie.reviews.find params[:id]
        permitted = params[:review].permit(:potatoes,:comments)
        @review.update_attributes!(permitted)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 19], ["id", 8], ["LIMIT", 1]]
UPDATE "reviews" SET "potatoes" = ?, "comments" = ? WHERE "reviews"."id" = ?  [["potatoes", 4], ["comments", "okokoko1234"], ["id", 9]]

    def destroy
      @review = @movie.reviews.find(params[:id])
      @review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 19], ["id", 8], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 8]]