app/controllers/sessions_controller.rb

INSERT INTO "moviegoers" ("name", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "kitsanapongK"], ["provider", "twitter"], ["uid", "1312711052023328770"], ["created_at", "2020-10-04 15:06:06.814060"], ["updated_at", "2020-10-04 15:06:06.814060"]]
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."provider" = ? AND "moviegoers"."uid" = ? LIMIT ?  [["provider", "twitter"], ["uid", "1312711052023328770"], ["LIMIT", 1]]
---
    def create
      auth=request.env["omniauth.auth"]
      user=Moviegoer.find_by(:provider => auth["provider"], :uid => auth["uid"]) ||
        Moviegoer.create_with_omniauth(auth)