app/models/moviegoer.rb

INSERT INTO "moviegoers" ("name", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "kitsanapongK"], ["provider", "twitter"], ["uid", "1312711052023328770"], ["created_at", "2020-10-04 15:06:06.814060"], ["updated_at", "2020-10-04 15:06:06.814060"]]
---
    def self.create_with_omniauth(auth)